Revit 2027 API
ConceptualConstructionShadeType Enumeration
 ConceptualConstructionType values for Shades.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ConceptualConstructionShadeType
Public Enumeration ConceptualConstructionShadeType
public enum class ConceptualConstructionShadeType
type ConceptualConstructionShadeType
Members
Member name | Value | Description
BasicShade | 0 |  Basic Shade
InvalidShadeTypeConstruction | -1 |  Invalid value/not set Shade Type Construction
NumShadeTypeConstruction | 1 |  Total Number of Shade Type Constructions
See Also
Reference
Autodesk.Revit.DB.Analysis Namespace